clc;clear
%% 整车参数
m=260; %整车质量kg
mb=220; %车身质量kg
mw=(m-mb)/4; %轮胎重力kg
Bf=1.2; %前轴轮距m
Br=1.2; %后轴轮距m
Lf=0.765; %质心距离前轴的距离m
Lr=0.765; %质心距离后轴的距离m
Ix=50; %整车x轴转动惯量kg*m^2
Iy=120; %整车y轴转动惯量kg*m^2
Iz=120; %整车z轴转动惯量kg*m^2
I_tire=2; %轮胎转动惯量/ kg*m^2
ks_f=22400; %前悬架垂直刚度N/m 
ks_r=24640; %后悬架垂直刚度N/m
Cs_f=2278; %前悬架阻尼 N/(m/s)
Cs_r=2368; %后悬架阻尼 N/(m/s)
kw=104000; %轮胎垂直刚度N/m
He=0.246; %车身质心至侧倾轴线的高度 m
Hp=0.244; %车身质心至俯仰中心的高度 m
f=0.015; %滚动阻力系数
r=0.195; %车轮滚动半径/ m
u=0.5; %路面附着系数
i_sw=4.3; %转向系传动比
g=9.8; %重力加速度
Cd=1.7; %空气阻力系数
A=1.15; %迎风面积m^2
p=1.2258; %空气密度 N*s^2/m^4

% Pn_motor=24.6; %电机额定功率 Kw
% Tn_motor=19.6; %电机额定扭矩 N*m
eta_FMotor = 1; %前电机效率
eta_RMotor = 1; %后电机效率

i_fa = 12; %前轴减速器齿比
i_ra = 12; %后轴减速器齿比

Cp_fl = 34.5; %左前轮制动效能
Cp_fr = 34.5; %右前轮制动效能
Cp_rl = 17; %左后轮制动效能
Cp_rr = 17; %右后轮制动效能
mu = 1.4; %附着系数
Sampletime = 0.001; %采样时间
Standstill_buffer = 0.2; %standstill的判定依据mps
vxlim = 0.1; %速度最小值mps


vx0=2/3.6; %初始Vx速度 m/s
w0=vx0/r; %初始轮速 rad/s
% v_obj=100; %期望车速 m/s

TD=0.7;%扭矩分配为前3后7



